<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Data type Titles Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in controllers for determine
    | the title of response messages that we need to return to the api.
    |
    */

    /*******************************
     *           Groups
     ******************************/
    'category' => [
        'title' => 'دسته بندی',
        'plural' => 'دسته بندی ها',
    ],
    'subject' => [
        'title' => 'موضوع',
        'plural' => 'موضوعات'
    ],

    /*******************************
     *          Features
     ******************************/
    'brand' => [
        'title' => 'برند',
        'plural' => 'برند ها',
    ],
    'color' => [
        'title' => 'رنگ',
        'plural' => 'رنگ ها',
    ],
    'size' => [
        'title' => 'سایز',
        'plural' => 'سایز ها',
    ],
    'warranty' => [
        'title' => 'گارانتی',
        'plural' => 'گارانتی ها',
    ],
    'unit' => [
        'title' => 'واحد',
        'plural' => 'واحد ها',
    ],

    /*******************************
     *        Specification
     ******************************/
    'spec' => [
        'title' => 'جدول مشخصات فنی',
        'plural' => 'جداول مشخصات فنی'
    ],
    'spec_header' => [
        'title' => 'عنوان جدول مشخصات فنی',
        'plural' => 'عنواین جدول مشخصات فنی'
    ],
    'spec_row' => [
        'title' => 'سطر جدول مشخصات فنی',
        'plural' => 'سطور جدول مشخصات فنی'
    ],
    
    /*******************************
     *            Blog
     ******************************/
    'article' => [
        'title' => 'مقاله',
        'plural' => 'مقالات',
    ],

    /*******************************
     *          Product
     ******************************/
    'product' => [
        'title' => 'محصول',
        'plural' => 'محصولات',
    ],

    /*******************************
     *          Financial
     ******************************/
    'shipping_method' => [
        'title' => 'متد ارسال',
    ],
    'order_status' => [
        'title' => 'وضعیت سفارش',
        'plural' => 'وضعیت های سفارش',
    ],
    'order' => [
        'title' => 'سفارش',
        'plural' => 'سفارشات',
    ],

    /*******************************
     *          Opinion
     ******************************/
    'comment' => [
        'title' => 'نظر',
        'plural' => 'نظرات',
    ],
    'review' => [
        'title' => 'نقد و بررسی',
        'plural' => 'نقد و بررسی ها',
    ],
    'question_and_answer' => [
        'title' => 'پرسش و پاسخ',
        'plural' => 'پرسش و پاسخ ها',
    ],

    /*******************************
     *           User
     ******************************/
    'role' => [
        'title' => 'نقش',
        'plural' => 'نقش ها',
    ],
    'permission' => [
        'title' => 'سطح دسترسی',
        'plural' => 'سطوح دسترسی',
    ],
    'user' => [
        'title' => 'کاربر',
        'plural' => 'کاربران',
    ],
];
